In [2]:
import pandas as pd
import numpy as np

### To store one dimensional data using pandas
Series data structure

In [3]:
list1=["A","B","C","D","E"]
series1=pd.Series(list1,index=["a","b","c","d","e"])

In [4]:
series1

a    A
b    B
c    C
d    D
e    E
dtype: object

In [5]:
array=np.random.randint(20,25,size=(10))

In [6]:
array

array([23, 22, 24, 21, 24, 23, 24, 21, 24, 22], dtype=int32)

In [7]:
series2=pd.Series(array)

In [8]:
series2

0    23
1    22
2    24
3    21
4    24
5    23
6    24
7    21
8    24
9    22
dtype: int32

In [9]:
series3=pd.Series(np.random.randint(30,35,size=(10)))

In [10]:
series3

0    33
1    33
2    33
3    32
4    34
5    31
6    32
7    34
8    30
9    31
dtype: int32

In [11]:
series2+series3

0    56
1    55
2    57
3    53
4    58
5    54
6    56
7    55
8    54
9    53
dtype: int32

### Data frame

In [12]:
students=["student1","student2","student3","student4","student5"]
rollno=['001','002','003','004','005']
scores=[45,56,54,67,87]

In [13]:
record={
    "students": students,
    "rollno": rollno,
    "scores": scores
}

In [14]:
record

{'students': ['student1', 'student2', 'student3', 'student4', 'student5'],
 'rollno': ['001', '002', '003', '004', '005'],
 'scores': [45, 56, 54, 67, 87]}

In [15]:
record_df=pd.DataFrame(record)

In [16]:
record_df

   students rollno  scores
0  student1    001      45
1  student2    002      56
2  student3    003      54
3  student4    004      67
4  student5    005      87

In [17]:
record_df.set_index(('rollno'))

        students  scores
rollno
001     student1      45
002     student2      56
003     student3      54
004     student4      67
005     student5      87

In [18]:
dict1={
    "A": [12,13,45,56,78],
    "B": [13,16,18,14,19],
    "C": [34,16,56,79,27],
    "D": [45,34,23,23,22]
}

In [19]:
dict1

{'A': [12, 13, 45, 56, 78],
 'B': [13, 16, 18, 14, 19],
 'C': [34, 16, 56, 79, 27],
 'D': [45, 34, 23, 23, 22]}

In [20]:
df1=pd.DataFrame(dict1)

In [21]:
df1

    A   B   C   D
0  12  13  34  45
1  13  16  16  34
2  45  18  56  23
3  56  14  79  23
4  78  19  27  22

In [22]:
df1.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [23]:
df1["A"]

0    12
1    13
2    45
3    56
4    78
Name: A, dtype: int64

In [24]:
df1[["A","B"]]

    A   B
0  12  13
1  13  16
2  45  18
3  56  14
4  78  19

In [25]:
df1

    A   B   C   D
0  12  13  34  45
1  13  16  16  34
2  45  18  56  23
3  56  14  79  23
4  78  19  27  22

In [26]:
df1["E"]=df1["A"]+df1["B"]+df1["C"]+df1["D"]

In [27]:
df1

    A   B   C   D    E
0  12  13  34  45  104
1  13  16  16  34   79
2  45  18  56  23  142
3  56  14  79  23  172
4  78  19  27  22  146

In [28]:
df1["F"]=df1["E"]/4

In [29]:
df1

    A   B   C   D    E      F
0  12  13  34  45  104  26.00
1  13  16  16  34   79  19.75
2  45  18  56  23  142  35.50
3  56  14  79  23  172  43.00
4  78  19  27  22  146  36.50

In [30]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 6 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   A       5 non-null      int64
 1   B       5 non-null      int64
 2   C       5 non-null      int64
 3   D       5 non-null      int64
 4   E       5 non-null      int64
 5   F       5 non-null      float64
dtypes: float64(1), int64(5)
memory usage: 372.0 bytes

In [31]:
dict2={
    "students":["student1","student2","student3","student4","student5","student6","student7",np.nan],
    "rollno":['005','003',np.nan,'005','001','012','013','014'],
    "gender":["male","female","male","male",np.nan,"female","female","male"],
    "marks_obtained":[65,75,70,98,99,63,np.nan,77]
}

In [32]:
dict2

{'students': ['student1',
  'student2',
  'student3',
  'student4',
  'student5',
  'student6',
  'student7',
  nan],
 'rollno': ['005', '003', nan, '005', '001', '012', '013', '014'],
 'gender': ['male', 'female', 'male', 'male', nan, 'female', 'female', 'male'],
 'marks_obtained': [65, 75, 70, 98, 99, 63, nan, 77]}

In [33]:
student_df=pd.DataFrame(dict2)

In [34]:
student_df

   students rollno  gender  marks_obtained
0  student1    005    male            65.0
1  student2    003  female            75.0
2  student3    NaN    male            70.0
3  student4    005    male            98.0
4  student5    001     NaN            99.0
5  student6    012  female            63.0
6  student7    013  female             NaN
7       NaN    014    male            77.0

In [35]:
student_df.isnull()

   students  rollno  gender  marks_obtained
0     False   False   False           False
1     False   False   False           False
2     False    True   False           False
3     False   False   False           False
4     False   False    True           False
5     False   False   False           False
6     False   False   False            True
7      True   False   False           False

In [36]:
student_df.isnull().sum()

students          1
rollno            1
gender            1
marks_obtained    1
dtype: int64

In [37]:
student_df.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6    False
7    False
dtype: bool

In [38]:
student_df.duplicated().sum()

np.int64(0)

In [39]:
student_df.drop_duplicates()

   students rollno  gender  marks_obtained
0  student1    005    male            65.0
1  student2    003  female            75.0
2  student3    NaN    male            70.0
3  student4    005    male            98.0
4  student5    001     NaN            99.0
5  student6    012  female            63.0
6  student7    013  female             NaN
7       NaN    014    male            77.0

In [40]:
student_df.dropna()

   students rollno  gender  marks_obtained
0  student1    005    male            65.0
1  student2    003  female            75.0
3  student4    005    male            98.0
5  student6    012  female            63.0

## Mean and mode imputation

In [47]:
gender_mode = student_df['gender'].mode()[0]

In [48]:
gender_mode

'male'

In [45]:
marks_mean=student_df['marks_obtained'].mean()
marks_mean

np.float64(78.14285714285714)

In [49]:
student_df['gender']=student_df['gender'].fillna(gender_mode)
student_df

   students rollno  gender  marks_obtained
0  student1    005    male            65.0
1  student2    003  female            75.0
2  student3    NaN    male            70.0
3  student4    005    male            98.0
4  student5    001    male            99.0
5  student6    012  female            63.0
6  student7    013  female             NaN
7       NaN    014    male            77.0

In [50]:
student_df['marks_obtained']=student_df['marks_obtained'].fillna(marks_mean)
student_df

   students rollno  gender  marks_obtained
0  student1    005    male       65.000000
1  student2    003  female       75.000000
2  student3    NaN    male       70.000000
3  student4    005    male       98.000000
4  student5    001    male       99.000000
5  student6    012  female       63.000000
6  student7    013  female       78.142857
7       NaN    014    male       77.000000